# Read all module files
read_verilog full_adder.sv
read_verilog ripple_carry_adder.sv
read_verilog multiplier.sv
read_verilog logical_and.sv
read_verilog logical_or.sv
read_verilog logical_xor.sv
read_verilog logical_not.sv
read_verilog shift_left.sv
read_verilog shift_right.sv
read_verilog alu.sv

synth -top alu
write_json RTL/alu/alu.json
